division_name division.

program-id.  program_id v1.


date-written.  7-jul-2020 - mb.

second_div_name division.

section-title section.

division_procedure division.

should not be displayed comment.

***--- comments should display

    45  cons_name1                          value 5.
    12  cons_name2                          value 8.
    32  cons_name3                        value 22.
    21  cons_name4                        value 33.
    
    TH  cons_error                        value notDisplayed.

    
    02  hex_dec_data                        pic x(48) value
    "000101202303304505606707808909A10B11C12D13E14C45".
    
        01  hex_dec_data                        pic x(48) value
    "000101202303305405606707808909A10C22C12D13E14D11".
    
 	display "Disp  value: " entry_char

    display "Disp:  " yes
    
    perform this_item again thru that_item again
    
    perform this_obj thru that_obj
    
        move entry_num  to v_num
    move space        to entry_number
    
    
    
    
        call "c$element" using entry_char "S".

    call "c$value" using entry_char, value 41.
    
    compute s_number = s_number / next_value * back_value ** (val_4 - ind)
    
    compute w_number =      w_number                  +                rest_divide *              current_base ** (16 -                 ind)
    